----------------------------------------------------------------------------
      name:  <unnamed>
       log:  /scratch/adibmk/justice/exhibits/table_victim_analysis.log
  log type:  text
 opened on:  28 Oct 2021, 12:55:45

. 
. /* open analysis dataset */
. use $jdata/justice_analysis, clear

. 
. /* create a variable that takes value 1 if victim identity */
. /* and defendant identity vary */
. gen gender_mismatch = (def_female + pet_female) == 1 if !mi(def_female) & 
> !mi(pet_female)
(6,312,591 missing values generated)

. gen religion_mismatch = (def_muslim + pet_muslim) == 1 if !mi(def_muslim) 
> & !mi(pet_muslim)
(6,075,271 missing values generated)

. 
. /* regenerate judge fixed effect which is wrong in this dataset for some r
> eason */
. drop judge

. egen judge = group(ddl_filing_judge_id)

. 
. /* create victim interaction variables */
. gen jdmale_mis = judge_def_male * gender_mismatch
(6,372,627 missing values generated)

. gen jmale_mis = judge_male * gender_mismatch
(6,372,627 missing values generated)

. gen dmale_mis = def_male * gender_mismatch
(6,312,591 missing values generated)

. gen jdmus_mis = judge_def_muslim * religion_mismatch
(6,103,278 missing values generated)

. gen jmus_mis = judge_muslim * religion_mismatch
(6,103,278 missing values generated)

. gen dmus_mis = def_muslim * religion_mismatch
(6,075,271 missing values generated)

. 
. /* create crimes against women interactions */
. gen jdmale_wc = judge_def_male * women_crime
(3,183,650 missing values generated)

. gen jmale_wc = judge_male * women_crime
(1,231,339 missing values generated)

. gen dmale_wc = def_male * women_crime
(3,020,680 missing values generated)

. 
. /* label variables */
. la var gender_mismatch "Gender mismatch"

. la var religion_mismatch "Religion mismatch"

. la var judge_male "Male judge"

. la var judge_muslim "Muslim judge"

. la var def_muslim "Muslim defendant"

. la var def_male "Male defendant"

. la var acq "Acquitted"

. label drop muslim

. 
. la var jdmale_mis "Male judge and defendant * Mismatch"

. la var jmale_mis "Male judge * Mismatch"

. la var dmale_mis "Male defendant * Mismatch"

. la var jdmus_mis "Muslim judge and defendant * Mismatch"

. la var jmus_mis "Muslim judge * Mismatch"

. la var dmus_mis "Muslim defendant * Mismatch"

. la var jdmale_wc "Male judge and defendant * Crime v. Women"

. la var jmale_wc "Male judge * Crime v. Women"

. la var dmale_wc "Male defendant * Crime v. Women"

. la var women_crime "IPC is Crimes Against Women"

. 
. /**********************/
. /* Outcome: Acquitted */
. /**********************/
. global gender_vars judge_male def_male 

. global religion_vars judge_muslim def_muslim 

. 
. /* we want the bias columns stored in the same variable */
. gen bias = judge_def_male
(2,387,547 missing values generated)

. 
. /* label bias coefficients for just this table */
. label var bias "Ingroup Bias"

. label var jdmale_mis "Ingroup Bias * Victim Gender Mismatch"

. label var jdmus_mis "Ingroup Bias * Victim Religion Mismatch"

. label var jdmale_wc "Ingroup Bias * Crime Against Women"

. 
. save $tmp/victim_tmp, replace
(note: file /scratch/adibmk/victim_tmp.dta not found)
file /scratch/adibmk/victim_tmp.dta saved

. 
. /* store timestamp */
. set_log_time


. 
. /* 1. gender victim interaction */
. reghdfe acquitted bias $gender_vars jdmale_mis jmale_mis dmale_mis gender_
> mismatch , absorb(loc_month judge acts) cluster(judge)
(dropped 24141 singleton observations)
note: judge_male is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 197 iterations)
note: judge_male omitted because of collinearity

HDFE Linear regression                            Number of obs   =  1,790,9
> 29
Absorbing 3 HDFE groups                           F(   6,  23790) =      40.
> 20
Statistics robust to heteroskedasticity           Prob > F        =     0.00
> 00
                                                  R-squared       =     0.29
> 21
                                                  Adj R-squared   =     0.24
> 63
                                                  Within R-sq.    =     0.00
> 03
Number of clusters (judge)   =     23,791         Root MSE        =     0.31
> 04

                             (Std. Err. adjusted for 23,791 clusters in judg
> e)
----------------------------------------------------------------------------
> --
             |               Robust
   acquitted |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interva
> l]
-------------+--------------------------------------------------------------
> --
        bias |   .0042027   .0034093     1.23   0.218    -.0024797    .01088
> 51
  judge_male |          0  (omitted)
    def_male |  -.0056588   .0029065    -1.95   0.052    -.0113558    .00003
> 82
  jdmale_mis |  -.0060937   .0049683    -1.23   0.220    -.0158319    .00364
> 46
   jmale_mis |   .0075697   .0040817     1.85   0.064    -.0004307      .015
> 57
   dmale_mis |  -.0148763   .0042855    -3.47   0.001    -.0232761   -.00647
> 65
gender_mis~h |   .0080682   .0034908     2.31   0.021     .0012259    .01491
> 05
       _cons |   .1537602   .0013874   110.82   0.000     .1510407    .15647
> 97
----------------------------------------------------------------------------
> --

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
   loc_month |     84322           0       84322     |
       judge |     23791       23791           0    *|
        acts |       883           1         882     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. estadd local FE "Court-month"

added macro:
                 e(FE) : "Court-month"

. estadd local judge "Yes"

added macro:
              e(judge) : "Yes"

. estadd local bias "Gender"

added macro:
               e(bias) : "Gender"

. estadd local sample "All"

added macro:
             e(sample) : "All"

. estimates store m1 

. 
. /* store sample & main coef from regression 1 in locals*/
. count if e(sample) == 1
  1,790,929

. local gmis_n = `r(N)'

. local gmis: di _b["jdmale_mis"]

. 
. /* store sample & main bias effect from reg 1 in paper stats csv */
. store_paper_stat `gmis_n' using $out/justice_paper_stats.csv, description(
> "Victim mismatch gender bias: sample") group("victim mismatch")


. store_paper_stat `gmis' using $out/justice_paper_stats.csv, description("V
> ictim mismatch gender bias: coef") group("victim mismatch")  


. 
. /* calculate effect on group most likely to see bias */
. lincom bias + jdmale_mis

 ( 1)  bias + jdmale_mis = 0

----------------------------------------------------------------------------
> --
   acquitted |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interva
> l]
-------------+--------------------------------------------------------------
> --
         (1) |   -.001891   .0033687    -0.56   0.575    -.0084938    .00471
> 18
----------------------------------------------------------------------------
> --

. 
. /* 2. religion victim interaction */
. /* replace bias with muslim bias variable so it takes same row in the esto
> ut table */
. replace bias = judge_def_muslim
(4,702,440 real changes made, 182,274 to missing)

. reghdfe acquitted bias $religion_vars jdmus_mis jmus_mis dmus_mis religion
> _mismatch , absorb(loc_month judge acts  ) cluster(judge)
(dropped 23910 singleton observations)
note: judge_muslim is probably collinear with the fixed effects (all partial
> led-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 218 iterations)
note: judge_muslim omitted because of collinearity

HDFE Linear regression                            Number of obs   =  2,022,4
> 73
Absorbing 3 HDFE groups                           F(   6,  24860) =      11.
> 37
Statistics robust to heteroskedasticity           Prob > F        =     0.00
> 00
                                                  R-squared       =     0.28
> 93
                                                  Adj R-squared   =     0.24
> 66
                                                  Within R-sq.    =     0.00
> 01
Number of clusters (judge)   =     24,861         Root MSE        =     0.30
> 78

                             (Std. Err. adjusted for 24,861 clusters in judg
> e)
----------------------------------------------------------------------------
> --
             |               Robust
   acquitted |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interva
> l]
-------------+--------------------------------------------------------------
> --
        bias |   .0007615   .0045244     0.17   0.866    -.0081067    .00962
> 96
judge_muslim |          0  (omitted)
  def_muslim |   .0086094   .0011564     7.44   0.000     .0063427    .01087
> 61
   jdmus_mis |   .0069092   .0076139     0.91   0.364    -.0080146    .02183
> 29
    jmus_mis |  -.0089976   .0051703    -1.74   0.082    -.0191317    .00113
> 65
    dmus_mis |  -.0126095   .0021243    -5.94   0.000    -.0167731   -.00844
> 58
religion_m~h |   .0031875    .001321     2.41   0.016     .0005982    .00577
> 68
       _cons |   .1465385    .000154   951.85   0.000     .1462368    .14684
> 03
----------------------------------------------------------------------------
> --

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
   loc_month |     88946           0       88946     |
       judge |     24861       24861           0    *|
        acts |       888           1         887     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. estadd local FE "Court-month"

added macro:
                 e(FE) : "Court-month"

. estadd local judge "Yes"

added macro:
              e(judge) : "Yes"

. estadd local bias "Religion"

added macro:
               e(bias) : "Religion"

. estadd local sample "All"

added macro:
             e(sample) : "All"

. estimates store m2

. 
. /* store sample & main coef from regression 2 in locals*/
. count if e(sample) == 1
  2,022,473

. local rmis_n = `r(N)'

. local rmis: di _b["jdmus_mis"]

. 
. /* store sample & main bias effect from reg 2 in paper stats csv */
. store_paper_stat `rmis_n' using $out/justice_paper_stats.csv, description(
> "Victim mismatch religion bias: sample") group("victim mismatch")


. store_paper_stat `rmis' using $out/justice_paper_stats.csv, description("V
> ictim mismatch religion bias: coef") group("victim mismatch")  


. 
. /* calculate effect on group most likely to see bias */
. lincom bias + jdmus_mis

 ( 1)  bias + jdmus_mis = 0

----------------------------------------------------------------------------
> --
   acquitted |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interva
> l]
-------------+--------------------------------------------------------------
> --
         (1) |   .0076706   .0062749     1.22   0.222    -.0046286    .01996
> 99
----------------------------------------------------------------------------
> --

. 
. /* 3. crimes against women interaction */
. /* replace bias with gender bias variable */
. replace bias = judge_def_male
(4,702,440 real changes made, 673,550 to missing)

. reghdfe acquitted bias $gender_vars jdmale_wc jmale_wc dmale_wc women_crim
> e , absorb(loc_month judge acts) cluster(judge)
(dropped 16466 singleton observations)
note: judge_male is probably collinear with the fixed effects (all partialle
> d-out values are close to zero; tol = 1.0e-09)
note: women_crime is probably collinear with the fixed effects (all partiall
> ed-out values are close to zero; tol = 1.0e-09)
(MWFE estimator converged in 325 iterations)
note: judge_male omitted because of collinearity
note: women_crime omitted because of collinearity

HDFE Linear regression                            Number of obs   =  5,149,6
> 67
Absorbing 3 HDFE groups                           F(   5,  32111) =      33.
> 34
Statistics robust to heteroskedasticity           Prob > F        =     0.00
> 00
                                                  R-squared       =     0.27
> 03
                                                  Adj R-squared   =     0.24
> 73
                                                  Within R-sq.    =     0.00
> 01
Number of clusters (judge)   =     32,112         Root MSE        =     0.30
> 68

                             (Std. Err. adjusted for 32,112 clusters in judg
> e)
----------------------------------------------------------------------------
> --
             |               Robust
   acquitted |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interva
> l]
-------------+--------------------------------------------------------------
> --
        bias |   .0004329   .0015432     0.28   0.779    -.0025919    .00345
> 76
  judge_male |          0  (omitted)
    def_male |  -.0074248    .001301    -5.71   0.000    -.0099747   -.00487
> 49
   jdmale_wc |  -.0093862   .0070177    -1.34   0.181    -.0231412    .00436
> 88
    jmale_wc |  -.0033918   .0075703    -0.45   0.654    -.0182298    .01144
> 62
    dmale_wc |   .0302145    .005987     5.05   0.000     .0184798    .04194
> 93
 women_crime |          0  (omitted)
       _cons |   .1517722   .0006468   234.64   0.000     .1505043      .153
> 04
----------------------------------------------------------------------------
> --

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
   loc_month |    124338           0      124338     |
       judge |     32112       32112           0    *|
        acts |       789           1         788     |
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

. estadd local FE "Court-month"

added macro:
                 e(FE) : "Court-month"

. estadd local judge "Yes"

added macro:
              e(judge) : "Yes"

. estadd local bias "Gender"

added macro:
               e(bias) : "Gender"

. estadd local sample "All"

added macro:
             e(sample) : "All"

. estimates store m3

. 
. /* store sample & main coef from regression 3 in locals*/
. count if e(sample) == 1
  5,149,667

. local wc_n = `r(N)'

. local wc: di _b["jdmale_wc"]

. 
. /* store sample & main bias effect from reg 3 in paper stats csv */
. store_paper_stat `wc_n' using $out/justice_paper_stats.csv, description("V
> ictim mismatch crimes agnst women: sample") group("victim mismatch")


. store_paper_stat `wc' using $out/justice_paper_stats.csv, description("Vic
> tim mismatch crimes agnst women: coef") group("victim mismatch")  


. 
. /* calculate effect on group most likely to see bias */
. lincom bias + jdmale_wc

 ( 1)  bias + jdmale_wc = 0

----------------------------------------------------------------------------
> --
   acquitted |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interva
> l]
-------------+--------------------------------------------------------------
> --
         (1) |  -.0089533   .0068999    -1.30   0.194    -.0224773    .00457
> 08
----------------------------------------------------------------------------
> --

. 
. esttab m1 m2 m3 using $out/victim_inter.tex, replace se(3) label star(* 0.
> 10 ** 0.05 *** 0.01) scalars("FE Fixed Effect" "judge Judge Fixed Effect" 
> "bias Bias" "sample Sample") keep(bias jdmale_mis jdmus_mis jdmale_wc) b(3
> )  
(note: file /scratch/adibmk/justice/exhibits/victim_inter.tex not found)
(output written to /scratch/adibmk/justice/exhibits/victim_inter.tex)

. 
. //estout_default using $out/victim_inter, order(bias jdmale_mis jdmus_mis 
> jdmale_wc)
. //cat $out/victim_inter.tex
. 
. cap log close
